export let updatelist = [
    {
        q:"1.这个游戏怎么玩？",
        a:"答：这个游戏是以装备为驱动的半放置类游戏，挑战副本能获得装备，装备的属性词条一切都是随机的，每挑战成功一个怪物，掉落装备的概率就会增加，所以人物的战斗力至关重要，如果人物的战斗力低于副本推荐战斗力，那么人物会受到来自于副本的压制效果，受到的伤害增加，所以大家要量力而行。"
    },
    {
        q:"2.人物属性有什么用？",
        a:"答：人物的属性涉及到人物的战斗力"
    },
    {
        q:"3.装备存在装备品质的属性吗？",
        a:"答：目前游戏的装备分为 N < R < SR < SSR < SP"
    },
    {
        q:"4.掉落的装备等级是怎么计算的？",
        a:"答：目前掉落装备是由挑战的副本等级决定，副本等级越高，掉落的装备等级越高"
    },
    {
        q:"4.战斗力不够，打不过怎么办？",
        a:"答：可挑战高等级的副本，一直打前几个怪物，或者挑战低等级副本提升人物自身属性"
    },
]