export let updatelist = [
    {
        date: '2022-6-7',
        detail: [
            '商店生成物品机制',
            '更换favicon',
            '完成商店部分功能'
        ],
        author: 'FanR'
    },
    {
        date: '2022-6-5',
        detail: [
            '完成战斗掉血机制',
            '完成人物自动恢复血量机制',
            '完成挑战失败自动退出副本机制',
            '完成基本背包点击事件雏形'
        ],
        author: 'FanR'
    },
    {
        date: '2022-6-4',
        detail: [
            '完成装备鼠标悬停展示功能',
        ],
        author: 'FanR'
    },
    {
        date: '2022-6-3',
        detail: [
            '修复装备图标都是武器图标的错误',
            '修复用户存档问题，第一次进入游戏存档不生效需要刷新',
            '完成系统消息提示实时更新',
            '完成高级任务只能挑战一次机制',
            '完成任务刷新有5秒CD的机制',
            '增加任务刷新成功、CD中的相应的消息提示',
            '修改战斗进度条按钮样式',
            '完成系统消息提示清除功能',
            '修复系统提示时间不正确的BUG'
        ],
        author: 'FanR'
    },
    {
        date: '2022-6-2',
        detail: [
            '修复任务图标404问题',
            '完成装备图标整理',
            '完成随机装备图片逻辑',
            '完成护甲、首饰、项链装备随机生成',
            '完成用户读取存档功能',
            '完成读取装备信息'
        ],
        author: 'FanR'
    },
    {
        date: '2022-6-1',
        detail: [
            '将战斗进度条组件逻辑完成（开始挑战生成组件，结束挑战销毁组件）',
            '修复点击开始战斗时任务列表不隐藏的bug',
            '完成系统消息初始化展示以及系统消息数据格式',
            '优化用户存档唯一性',
            '优化武器掉落机制：副本难度越高，挑战怪物越靠后，掉落稀有度越高',
            '抽离随机任务生成逻辑',
            '待完成挑战稀有任务后将其删除逻辑'
        ],
        author: 'FanR'
    },
    {
        date: '2022-5-31',
        detail: [
            '完成战斗进度条布局',
            '完成Player移动机制',
            '待完成具体战斗机制'
        ],
        author: 'FanR'
    },
    {
        date: '2022-5-29',
        detail: [
            '完成整体页面布局',
            '完成用户详情组件',
            '完成初始化用户数据',
            '完成用户导出存档功能',
            '完成Footer的封装',
            '完成随机武器名称逻辑',
            '新增用户存档数据一键复制功能',
            '修复引用组件弹窗页面产生挤压问题',
            '构思左侧系统消息体系&挑战副本'
        ],
        author: 'FanR'
    },
    {
        date: '2022-5-27',
        detail: [
            '完成随机任务的逻辑',
            '完成任务挑战弹框',
            '完成随机任务挑战展示页'
        ],
        author: 'FanR'
    },
    {
        date: '2022-5-16',
        detail: [
            '完成随机装备生成逻辑',
            '制作随机生成武器展示页面',
            '构思随机任务生成逻辑'
        ],
        author: 'FanR'
    },
    {
        date: '2022-5-1',
        detail: [
            '界面原型构思(80%)',
            '构思随机装备生成逻辑'
        ],
        author: 'FanR'
    },
]