export const weaponintro = [
    '潘多拉的盒子',
    '普罗米修斯盗天火给人间后，主神宙斯为惩罚人类',
    '-命令神用黏土塑成一个年轻美貌、虚伪狡诈的姑娘，取名“潘多拉”，意为“具有一切天赋的女人',
    '并给了她一个礼盒，然后将她许配给普罗米修斯的弟弟埃庇米修斯',
    '埃庇米修斯不顾禁忌地接过礼盒，潘多拉趁机打开它',
    '于是各种恶习、灾难和疾病立即从里面飞出来',
    '盒子里只剩下唯一美好的东西——希望',
    '但希望还没来得及飞出来，潘多拉就将盒子永远地关上了',

    '达摩克利斯剑',
    '达摩克利斯是希腊神话中暴君迪奥尼修斯的宠臣，他常说帝王多福，以取悦帝王',
    '有一次，迪奥尼修斯让他坐在帝王的宝座上，头顶上挂着一把仅用一根马鬃系着的利剑',
    '以此告诉他，虽然身在宝座，利剑却随时可能掉下来',
    '帝王并不多福，而是时刻存在着忧患',

    '缪斯',
    '缪斯是希腊神话中九位文艺和科学女神的通称',
    '她们均为主神和记忆女神之女',
    '她们以音乐和诗歌之神阿波罗为首领',
    '分别掌管着历史、悲剧、喜剧、抒情诗、舞蹈、史诗、爱情诗、颂歌和天文',
    '古希腊的诗人、歌手都向缪斯呼告，祈求灵感',
    '后来，人们就常用“缪斯”来比喻文学、写作和灵感等',
]

export const armointro = [

    '斯芬克斯之谜',
    '斯芬克斯是希腊神话中以隐谜害人的怪物，埃及最大的胡夫金字塔前的狮身人面怪兽就是他',
    '他给俄狄浦斯出的问题是：什么东西早晨用四只脚走路，中午用两只脚走路，傍晚用三只脚走路？',
    '俄狄浦斯回答：是人',
    '在生命的早晨，他是个孩子，用两条腿和两只手爬行',
    '到了生命的中午，他变成壮年，只用两条腿走路',
    '到了生命的傍晚，他年老体衰，必须借助拐杖走路，所以被称为三只脚',
    '斯芬克斯羞愧坠崖而死',
    '“斯芬克斯之谜”常被用来比喻复杂、神秘、难以理解的问题',

    '皮格马利翁',
    '皮格马利翁是希腊神话中的塞浦路斯国王',
    '他憎恨女性，决定永不结婚',
    '他用神奇的技艺雕刻了一座美丽的象牙女像，并爱上了她',
    '他像对待自己的妻子那样抚爱她，装扮她，并向神乞求让她成为自己的妻子',
    '爱神阿芙洛狄忒被他打动，赐予雕像生命，并让他们结为夫妻',
    '“皮格马利翁效应”后来被用在教育心理学上，也称“期待效应”或“罗森塔尔效应”',
    '比喻教师对学生的期待不同，对他们施加的方法不同，学生受到的影响也不一样',
]

export const leftequipment = [
    '犹大的亲吻',
    '犹大是《圣经》中耶稣基督的亲信子弟12门徒之一',
    '耶稣传布新道虽然受到了百姓的拥护，却引起犹太教长老司祭们的仇恨',
    '他们用30个银币收买了犹大，要他帮助辨认出耶稣',
    '他们到客马尼园抓耶稣时，犹大假装请安，拥抱和亲吻耶稣。耶稣随即被捕，后被钉死在十字架',
    '人们用“犹大的亲吻”比喻可耻的叛卖行为',

    '诺亚方舟',
    '出自《圣经》。上帝对人类所犯下的罪孽非常忧伤，决定用洪水消灭人类',
    '诺亚是个正直的人，上帝吩咐他造船避灾',
    '经过40个昼夜的洪水，除诺亚一家和部分动物外，其他生物都被洪水吞没',
    '后被用来比喻灾难中的避难所或救星',

    '伊甸园',
    '亚当和夏娃住在伊甸园中，上帝允许他们食用园中的果实，唯独“知善恶树”上的果实不能吃',
    '狡猾的蛇引诱他们吃了禁果',
    '从此他们懂得了善恶，辨别出真假，而且产生了羞耻之心',
    '上帝因此将他们逐出伊甸园',
    '禁果比喻被禁止得到而又渴望得到的东西。',
]

export const rightequipment = [
    '多米诺骨牌',
    '一种西洋游戏，将许多长方形的骨牌竖立排列成行',
    '轻轻推倒第1张牌时，其余骨牌将依次纷纷倒下',
    '用于比喻时，“多米诺骨牌效应”常指一系列的连锁反应，即“牵一发而动全身”',

    '象牙塔',
    '出自19世纪法国诗人、文艺批评家圣佩韦·查理·奥古斯丁的书函《致维尔曼》',
    '奥古斯丁批评同时代的法国作家维尼作品中的悲观消极情绪',
    '主张作家从庸俗的资产阶级现实中超脱出来，进入一种主观幻想的艺术天地——象牙之塔。',
    '“象牙塔”被用来比喻与世隔绝的梦幻境地。',

    '滑铁卢',
    '1815年，在比利时的滑铁卢，拿破仑率领法军与英国、普鲁士联军展开激战，法军惨败',
    '随后，拿破仑以退位结束了其政治生涯',
    '“滑铁卢”被用来比喻惨痛的失败。',

    '鳄鱼的眼泪',
    '西方传说，鳄鱼捕到猎物时，一边贪婪地吞噬，一边假惺惺地流泪',
    '喻指虚假的眼泪，伪装的同情',
    '又被引申为一面伤害别人，一面装出悲天悯人的阴险狡诈之徒',
]